soapandrest/src/test/resources/allsoaps.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.baeldung.com/springsoap/gen">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getAllSoapsRequest/>
    </soapenv:Body>
</soapenv:Envelope>